Output from `terraform plan`
```
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["person"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-person-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "person"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "person"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-prisoner-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-prisoner-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-prisoner-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "prisoner"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "prisoner"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-prisoner-address-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-prisoner-address-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-prisoner-address-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "prisoner-address"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "prisoner-address"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-prisoner-profile-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-prisoner-profile-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-prisoner-profile-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "prisoner-profile"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "prisoner-profile"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-reference-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-reference-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-reference-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-sentence-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-sentence-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-sentence-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-visits-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-visits-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-visits-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-nomis-oracle-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "oracle"
      + extra_connection_attributes = "supportResetlog=TRUE"
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = (sensitive value)
      + server_name                 = (sensitive value)
      + ssl_mode                    = "none"
      + tags                        = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-preproduction"
      + cdc_inserts_and_updates                     = true
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-nomis-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-dms-nomis-operator-s3-target-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-dms-nomis-s3-target-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-nomis-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-nomis-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-nomis-operator-s3-target-role"
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-nomis-s3-endpoint-role"
    }

Plan: 116 to add, 42 to change, 0 to destroy.

```